In [2]:
#import pandas 
import pandas as pd

In [3]:
#pandas has 2 main data type 
# first we tryout series data type 
# series data type is one dimensional 
# its input is list 
# pd.Series(list) - syntax will look like this

In [4]:
ser = pd.Series(["Maths","Physics","Chemistry","OOP"])

In [5]:
#print the series 
ser

0        Maths
1      Physics
2    Chemistry
3          OOP
dtype: object

In [6]:
ser2 = pd.Series(["Black","White","Blue","Red"])
ser2

0    Black
1    White
2     Blue
3      Red
dtype: object

In [8]:
#Another datatype is  DataFrame
# its 2 dimensional 
#its input argument is a dictionary 
df1 = pd.DataFrame({"Maths":[10,20,50,60,90] , "Grade":["F","F","P","B","G"]})
#MAths column contains the marks 
#Grade Column contains the Grade 
# marks less than 50 is failes so grade - F
# marks 50-59 - P
# marks 60-69 - B
# marks 70-79 - A
# marks 80-89 - G
#Now we can print the dataframe that we created just now 
df1

   Maths Grade
0     10     F
1     20     F
2     50     P
3     60     B
4     90     G

In [9]:
#this will give the datatype of each column
df1.dtypes

Maths     int64
Grade    object
dtype: object

In [12]:
#this will count total number of elemnts in each column
df1.count()

Maths    5
Grade    5
dtype: int64

In [13]:
#Lets create another Dataframe 
#gaming laptop brands 
model = pd.Series(["Asus","Lenova","Apple","Hp"])
price = pd.Series(["50K","45K","100K","65K"])
#So we created 2 Series of data 
gamelaptop = pd.DataFrame({
        "Model" : model , 
        "Price" : price , 
    })

gamelaptop

    Model Price
0    Asus   50K
1  Lenova   45K
2   Apple  100K
3      Hp   65K

In [24]:
# Now access particular row and column
#Firest access a particular column with index 
print("Price Column")
gamelaptop.loc[:,"Price"]

Price Column

0     50K
1     45K
2    100K
3     65K
Name: Price, dtype: object

In [25]:
#Now access the model name column 
print("Company name column")
gamelaptop.loc[:,"Model"]

Company name column

0      Asus
1    Lenova
2     Apple
3        Hp
Name: Model, dtype: object

In [26]:
# Now we can select a single row 
gamelaptop.loc[0,:]

Model    Asus
Price     50K
Name: 0, dtype: object

In [41]:
#get the column names
list(gamelaptop.keys())
for i in list(gamelaptop.keys()):
    print(gamelaptop.loc[:,i])
    #print(gamelaptop.loc[:,i])

0      Asus
1    Lenova
2     Apple
3        Hp
Name: Model, dtype: object
0     50K
1     45K
2    100K
3     65K
Name: Price, dtype: object

In [43]:
#acessing particular value from the table 
gamelaptop.loc[3,"Price"]

'65K'

In [44]:
#We can also read excel , csv files etc.
#Becoz when work with data we had data in some format like excel or csv type 

car_sales_data = pd.read_csv("data/car-sales.csv")

In [45]:
car_sales_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describe Data

In [48]:
car_sales_data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [49]:
#get column index 
car_sales_data.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [51]:
#get row index 
car_sales_data.index

RangeIndex(start=0, stop=10, step=1)

In [52]:
car_sales_data.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [53]:
# price column not considered becoz , its type is object 
# its not a numerical value . describe() only work on numerical valued columns

In [54]:
#get the dimension 
car_sales_data.ndim

2

In [59]:
car_sales_data.size
#this will return total number of elements in the table 
# that means , each column has 10 elements 
# and we have total five columns . so total number of elements is 5 x 10  = 50

50

In [60]:
car_sales_data.axes
#this will give the axes of the dataframe

[RangeIndex(start=0, stop=10, step=1),
 Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')]

In [62]:
car_sales_data.info()
#this will give the overview of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [63]:
gamelaptop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Model   4 non-null      object
 1   Price   4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [66]:
#Statistical analysis 
#its only work on numerical valued columns 
car_sales_data.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [65]:
car_sales_data.median()

Odometer (KM)    57369.0
Doors                4.0
dtype: float64

In [67]:
car_sales_data.sum()
#this find the sum of each columns 
#if the datatype of elements in a column is not numerical values and its some object or string 
#this will add all the values together

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [71]:
car_sales_data.loc[:,"Odometer (KM)"].sum()

786014

In [72]:
#finding sum of a column 
car_sales_data["Odometer (KM)"].summ()

786014